spacecmu-backend/tests/artillery/05-market.yml
# Artillery Test: Market
# Tests: GET items, GET categories, POST item, PATCH status, DELETE
# Run: artillery run --config config.yml 05-market.yml

config:
  target: "http://localhost:3001"
  http:
    timeout: 15
  variables:
    token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6ImYxMjU5OTdkLWM3MTYtNDlmZi1hMDY3LWM5ZmQwYzBlNDk0NCIsInJvbGUiOiJ1c2VyIiwidXNlcm5hbWUiOiI2NTA2MTIxMDIiLCJlbWFpbCI6InNpcmFwaG9iX2x1QGNtdS5hYy50aCIsIml0YWNjb3VudF9uYW1lIjoic2lyYXBob2JfbHUiLCJwcmVuYW1lX1RIIjoiIiwiZmlyc3RuYW1lX1RIIjoi4Liq4Li04Lij4Lig4LieIiwibGFzdG5hbWVfVEgiOiLguYDguKvguKXguLfguK3guIfguJvguKPguLDguYDguKrguKPguLTguJAiLCJvcmdhbml6YXRpb25fbmFtZV9USCI6IuC4hOC4k-C4sOC4p-C4tOC4qOC4p-C4geC4o-C4o-C4oeC4qOC4suC4quC4leC4o-C5jCIsImlhdCI6MTc3MzU4OTA0MiwiZXhwIjoxNzczNjc1NDQyfQ.7a_C0TnKVkRs9lEa3ge4Odxupdn1kc6HvOXVShkDPFY"
    myUserId: "f125997d-c716-49ff-a067-c9fd0c0e4944"
  phases:
    - duration: 15
      arrivalRate: 3
      name: "Warm Up"
    - duration: 30
      arrivalRate: 3
      rampTo: 15
      name: "Ramp Up"
    - duration: 30
      arrivalRate: 15
      name: "Sustained Load"

scenarios:
  - name: "Browse Market Items"
    weight: 7
    flow:
      - get:
          url: "/api/market/items"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Get Market Categories"
    weight: 3
    flow:
      - get:
          url: "/api/market/categories"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Get My Market Items"
    weight: 3
    flow:
      - get:
          url: "/api/market/items/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Get Market Items by User"
    weight: 2
    flow:
      - get:
          url: "/api/market/user/{{ myUserId }}/items"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  # Write scenario: Create item → update status → delete
  - name: "Create Item → Update Status → Delete"
    weight: 2
    flow:
      # 1. Create item
      - post:
          url: "/api/market/items"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            title: "Artillery Test Item {{ $randomString() }}"
            description: "Test item created by Artillery load test"
            price: 199
            category: "Electronics"
            condition: "used"
          capture:
            - json: "$.id"
              as: "itemId"
          expect:
            - statusCode: 201

      # 2. View the item
      - get:
          url: "/api/market/items/{{ itemId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # 3. Mark as sold
      - patch:
          url: "/api/market/items/{{ itemId }}/status"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          json:
            status: "sold"
          expect:
            - statusCode: 200

      # 4. Delete item
      - delete:
          url: "/api/market/items/{{ itemId }}"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200